In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series(['1.0','2000',3000])

In [3]:
print(s)

0     1.0
1    2000
2    3000
dtype: object

In [4]:
s1 = pd.to_numeric(s)

In [5]:
print(s1)

0       1.0
1    2000.0
2    3000.0
dtype: float64

In [6]:
s2 = (['1.0','#APPLE', 2000])

In [8]:
pd.to_numeric(s2, errors = 'ignore') #ignore argument

array(['1.0', '#APPLE', 2000], dtype=object)

In [10]:
a = pd.to_numeric(s2, errors = 'coerce')

In [11]:
print(a)

[1.e+00    nan 2.e+03]

In [93]:
de = {'training':['DS','ML','DL','AI'], 'hours':[np.nan,np.nan,2,4]}

In [94]:
df1 = pd.DataFrame(de)

In [49]:
print(df)

  training     Tools         fee
0       DS  2#$@DEad  $%#$3AEdaf
1       ML    Ra4$%^          30
2       DL         2         NaN
3       DS         4           4

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
Tools       2 non-null float64
fee         1 non-null float64
dtypes: float64(2), object(1)
memory usage: 176.0+ bytes

In [18]:
#handling null values
df.dropna(axis = 0) #By using dropna we are able to drop entire row which contains the null value

  training  Tools  fee
3       DS    4.0  4.0

In [19]:
df.dropna(axis=1) #by using axis=1 we are able to drop entire column

  training
0       DS
1       ML
2       DL
3       DS

In [20]:
df.dropna(subset = ['training'])

  training  Tools  fee
0       DS    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [21]:
df.dropna(subset = ['Tools'])

  training  Tools  fee
2       DL    2.0  NaN
3       DS    4.0  4.0

In [38]:
df.dropna(thresh =2)

  training  Tools  fee
2       DL    2.0  NaN
3       DS    4.0  4.0

df

In [36]:
df

  training  Tools  fee
0      NaN    NaN  NaN
1       ML    NaN  NaN
2       DL    2.0  NaN
3       DS    4.0  4.0

In [39]:
#Filling the null values
df.fillna(10)

  training  Tools   fee
0       10   10.0  10.0
1       ML   10.0  10.0
2       DL    2.0  10.0
3       DS    4.0   4.0

In [42]:
df.fillna(df.mean())

  training  Tools   fee
0       DS    3.0  17.0
1       ML    3.0  30.0
2       DL    2.0  17.0
3       DS    4.0   4.0

In [43]:
df

  training  Tools   fee
0       DS    NaN   NaN
1       ML    NaN  30.0
2       DL    2.0   NaN
3       DS    4.0   4.0

In [44]:
df.replace(4, 400)

  training  Tools    fee
0       DS    NaN    NaN
1       ML    NaN   30.0
2       DL    2.0    NaN
3       DS  400.0  400.0

In [45]:
df.replace([2,4], 400)

  training  Tools    fee
0       DS    NaN    NaN
1       ML    NaN   30.0
2       DL  400.0    NaN
3       DS  400.0  400.0

In [46]:
df.replace([2,4],[222, 442])

  training  Tools    fee
0       DS    NaN    NaN
1       ML    NaN   30.0
2       DL  222.0    NaN
3       DS  442.0  442.0

In [53]:
df

  training     Tools         fee
0       DS  2#$@DEad  $%#$3AEdaf
1       ML    Ra4$%^          30
2       DL         2         NaN
3       DS         4           4

In [58]:
df.replace(regex = True, to_replace = '[^0-9]+', value = '')

  training Tools  fee
0              2    3
1              4   30
2              2  NaN
3              4    4

In [73]:
df.iloc[:,1:3] = df.iloc[:,1:3].replace(regex= True, to_replace = '[^0-9]+', value = '')

In [74]:
df

  training Tools  fee
0       DS     2    3
1       ML     4   30
2       DL     2  NaN
3       DS     4    4

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
training    4 non-null object
Tools       4 non-null object
fee         3 non-null object
dtypes: object(3)
memory usage: 176.0+ bytes

In [79]:
#Joining
df.append(df1) #To perform

  training Tools  fee
0       DS     2    3
1       ML     4   30
2       DL     2  NaN
3       DS     4    4
0       DS   NaN  NaN
1       ML   NaN   30
2       DL     2  NaN
3       DS     4    4

In [92]:
pd.concat([df, df1], axis = 1)

  training Tools  fee training  hours
0       DS     2    3       DS    NaN
1       ML     4   30       ML    NaN
2       DL     2  NaN       DL    2.0
3       DS     4    4       DS    4.0

In [88]:
e

  Tools  fee training
0     2    3       DS
1     4   30       ML
2     2  NaN       DL
3     4    4       DS
0   NaN  NaN       DS
1   NaN  NaN       ML
2     2  NaN       DL
3     4  NaN       DS

In [95]:
df

  training Tools  fee
0       DS     2    3
1       ML     4   30
2       DL     2  NaN
3       DS     4    4

In [96]:
df1

  training  hours
0       DS    NaN
1       ML    NaN
2       DL    2.0
3       AI    4.0

In [97]:
pd.merge(df,df1, how = 'left', on = 'training')

  training Tools  fee  hours
0       DS     2    3    NaN
1       ML     4   30    NaN
2       DL     2  NaN    2.0
3       DS     4    4    NaN

In [98]:
pd.merge(df,df1, how = 'right', on = 'training')

  training Tools  fee  hours
0       DS     2    3    NaN
1       DS     4    4    NaN
2       ML     4   30    NaN
3       DL     2  NaN    2.0
4       AI   NaN  NaN    4.0

In [99]:
pd.merge(df,df1, how = '', on = 'training')

  training Tools  fee  hours
0       DS     2    3    NaN
1       DS     4    4    NaN
2       ML     4   30    NaN
3       DL     2  NaN    2.0